micropython/micropython/ports/esp32/boards/ESP32_S2_WROVER/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "ESP32-S2-WROVER"
#define MICROPY_HW_MCU_NAME                 "ESP32-S2"

#define MICROPY_PY_BLUETOOTH                (0)
#define MICROPY_HW_ENABLE_SDCARD            (0)

#define MICROPY_HW_I2C0_SCL                 (7)
#define MICROPY_HW_I2C0_SDA                 (6)

#define MICROPY_HW_SPI1_MOSI                (35)
#define MICROPY_HW_SPI1_MISO                (37)
#define MICROPY_HW_SPI1_SCK                 (36)
#define MICROPY_HW_SPI2_MOSI                (11)
#define MICROPY_HW_SPI2_MISO                (13)
#define MICROPY_HW_SPI2_SCK                 (12)
